<?xml version="1.0" encoding="ISO-8859-15"?>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
    <title>Demodokkari</title>

	<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
	<meta http-equiv="Content-Language" content="fi" />
<style>

/* ajankäyttö */

table.ajankaytto,table.ajankaytto tr, table.ajankaytto th, table.ajankaytto td, table.ajankaytto tr {
	border: 0px;
	border-spacing: 0px;
	padding: 1px 3px 1px 3px;
	margin: 0px;
	font-weight: normal;
	text-align: left;
}

table.ajankaytto thead th {
	font-weight: bold;
	text-align: center;
}

table.ajankaytto thead td {
	font-weight: normal;
	text-align: center;
}

table.ajankaytto tbody th {
	font-weight: normal;
	text-align: left;
	border-top: 1px solid #000000;
}

table.ajankaytto tbody td {
	font-weight: normal;
	text-align: right;
	border-top: 1px solid #000000;
	border-left: 1px solid #000000;
}

table.ajankaytto tfoot td {
	border-top: 1px solid #000000;
}

</style>
</head>
<body>

<h1>Demo</h1>


<h2>Projektin arviointi</h2>

<p>Harjoitustyössä toteutuetaan Automaatio- ja Systeemitekniikan killalle uusi sisällönhallintajärjestelmä ja nettisivusto. Sivuston nykyinen versio on osoitteessa http://as.tky.fi/. Uuden sivuston kehitysversiota pyöritetään osoitteessa http://aski.hut.fi/uusi/.</p>

<p>Sivusto sisältää muun muassa aktiivikillisteille ajankohtaisia uutisia, tapahtumakalenterin, ilmoittautumistoiminnon ja gallupin, sekä ulkopuolisille tietoa killasta. Projektin aluperäinen lähtökohta oli, että sivujen päivittämisen täytyy helpottua nykyisestä, joten sivustoon täytyy toteuttaa myös tehokkaat web-pohjaiset ylläpitotyökalut.</p>

<p>Projektin toteutus on demovaiheessa 21.4.2008 siinä vaiheessa, että navigointi, dynaaminen sivuhierarkia ja sivujen editointi toimivat. Arkkitehtuurikin alkaa vakiintua. Apumoduulit, kuten tapahtumakalenteri, ilmoittautuminen ja etusivun uutiset ovat vielä stattista mallisisältöä.</p>

<h2>Kohderyhmäanalyysi</h2>

<p>Olemme kartoittaneet käyttäjäryhmiä ja käyttötapoja henkilökohtaisen käyttökokemuksen ja epämuodollisten kyselyjen perusteella, ja päätyneet seuraaviin merkittäviin käyttäjäryhmiin: kiltalaiset, phuksit, abit, sponsorit ja ulkopuoliset. Seuraavassa pohditaan näiden ryhmien erityispiirteitä ja käyttötapoja.</p>

<h3>Kiltalaiset</h3>
<p>Sivuston suurin käyttäjäryhmä ovat aktiiviset kiltalaiset. Tyypillisiä käyttötapauksia ovat:</p>
<ul>
<li>Webbikameran katsominen</li>
<li>Tapahtumiin ilmoittautuminen (suora linkki on mainospostissa)</li>
<li>Tapahtumien ajakohdan katsominen tapahtumakalenterista</li>
<li>Läpikulku valokuvagalleriaan tai wikiin, jotka ovat erillisiä sivustoja</li>
<li>Hyödyllisen tiedon etsiminen, esimerkiksi tilinumerot, yhteystiedot tai pöytäkirjat</li>
</ul>

<p>Sivustoa katsotaan tyypillisesti laadukkaalla tietokoneella (ei kännykällä) kotoa tai työpaikalta. Käyttäjillä on tiedossa päämäärä, eivätkä he surffaile sivustolla sattumanvaraisesti. Tiedon täytyy siis olla helposti löydettävissä, eikä viihteellistä sisältöä tarvitse tyrkyttää samalla tavalla kuin sivustoilla, joiden tavoitteena on kerätä rahaa koukuttamalla käyttäjät.</p>

<p>Aktiivikiltalaisten käyttöön liittyvät seuraavat erityispiirteet:</p>
<ul>
<li>Webbikamera saatetaan jättää taustalle auki. Sivusto ei siis saa kuormittaa selainta ja sitä kautta tietokonetta turhaan.</li>
<li>Linkkejä saatetaan lähettää sähköpostitse, eli niiden on näytettävä järkeviltä.</li>
<li>Sivuja saatetaan bookmarkata (esim. webcam). Urlit eivät saa vaihdella.</li>
</ul>


<h3>Phuksit</h3>
<p>Phuksit käyttävät sivustoa paljolti samalla tavalla kuin aktiivikiltalaiset, mutta heillä on omia erityistarpeita:</p>
<ul>
<li>Opiskelua tukevan tiedon etsiminen opiskelun alkuvaiheessa (kartat, ohjeet, linkit)</li>
<li>Kiltatoimintaa koskevan tiedon etsiminen (phukseille suunnatut tapahtumat, phuksipisteiden kerääminen)</li>
</ul>

<p>Käyttäjäryhmässä on myös se erityispiirre, että osa phukseista on vasta potentiaalisia aktiivikiltalaisia, ja siksi nettisivujen on annettava kiltatoiminnasta houkutteleva kuva. Esimerkiksi kuvavalinnoilla voidaan luoda positiivista mielikuvaa iloisesta yhdessätekemisestä, ja vastaavasti välttää kielteisiä stereotypioita.</p>

<h3>Ulkomaalaisopiskelijat</h3>
<p>Ulkomaalaisopiskelijat käyttäytyvät samoin kuin aktiivikiltalaiset tai phuksit, mutta tarvitsevat sisällön englanniksi. Lähtökohtaisesti kaikki sisältö käännetään ainakin lyhyesti.</p>

<h3>Abit</h3>
<p>Abit saattavat päätyä killan sivuille etsiessään opiskelupaikkaa. Käyttäjäryhmä on tärkeä, koska oikeantyyppisen opiskelija-aineksen haaliminen laitokselle on myös killan etu. Killan nettisivuilla on myös jonkinlainen vastuu siitä, minkälaisen kuvan abit saavat TKK:sta kokonaisuudessaan. Kuten phuksien tapauksessa, nettisivujen tulee luoda positiivista mielikuvaa ja hälventää teekkariutta koskeavia stereotypioita. Abit voivat hyvin todennäköisesti printata sivuja kerätessään materiaalia opiskelupaikoista, joten printtien ulkoasuun on oltava kelvollinen.</p>

<h3>Sponsorit</h3>
<p>Sponsoreilla tarkoitetaan tahoja, joilta kilta anoo rahaa, jotka tulevat killan sivuille tarkistamaan, millaisesta ryhmästä on kysymys. Tämä käyttäjäryhmä on hyvin pieni, mutta erittäin tärkeä, koska kyse on rahasta. Koko sivuston on näytettävä ammattimaiselta ja uskottavalta. Tämä asettaa merkittäviä rajoituksia sivuston ulkoasuun, kun käyttäjäryhmä vieläpä kuuluu vanhempaan ikäluokkaan kuin aiemmin mainitut ryhmät. Ulkoasun on siis oltava riittävän konservatiivinen. Sponsorit ovat myös todennäköisiä printtaajia, ja siisteillä printeilla voidaan luoda ammattimainen vaikutelma.</p>

<h3>Ulkopuoliset</h3>
<p>Sivustolle voi eksyä esimerkiksi kiltalaisten vanhempia tai työnantajia, joille on annettava riittävän vakava kuva kiltatoiminnasta. Erityisesti on huolehdittava, että jokainen yksittäinen tunnistettava kiltalainen esiintyy positiivisessa valossa. Tämä vaikuttaa esimerkiksi valokuvien valintaan.</p>

<h3>Ylläpitäjät</h3>
<p>Sivustoa ylläpitää lähtökohtaisesti killan tiedottaja. Erityisesti ajankohtaisia uutisia päivitetään usein, joten käytön on oltava riittävän vaivatonta. Lisäksi sekalaiset hallituslaiset ja toimihenkilöt voivat päivittää oman vastuualueensa sivuja, joten ylläpitokäyttöliittymän on oltava melko helposti omaksuttavissa.</p>

<h2>Sivuston sisältö</h2>

<p>Vanhan sivuston sisältö olisi sellaisenaan melko kelvollista, mutta sitä kirjoitettaan uusiksi siinä määrin, että kurssin vaatimustaso täyttyy.Seuraavassa esitetään sivukohtainen erittely sivuston sisällöstä.</p>

<img src="kaavio.jpg" alt="kaavio sivuston rakenteesta" />

<p>Sivuston rakenne tälläisenään toimii hyvin kohderyhmälle, koska siinä jokaiselle kohderyhmälle muodostuu pääsivu ja siihen liittyvät alasivut. Jokaisesta sivusta on tarkemmin alla.</p>

<p><strong>Etusivu</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Uutiset, tapahtumakalenteri,  gallup (dynaamisia ja ajankohtaisia)</li>
  <li>Kohderyhm&auml;t: aktiivikillistit (t&auml;rke&auml;)</li>
  <li>Tavoitteet: Sis&auml;lt&auml;&auml; aktiivikillistien  useimmiten etsim&auml;n tiedon. Ohjaa vierailijat eteenp&auml;in.</li>
  <li>L&auml;hdemateriaali: Killan tiedottaja  p&auml;ivitt&auml;&auml; tapahtumakalenteria ja galluppia, sek&auml; lis&auml;&auml; uutisia.</li>
  <li>Muokkaus: Tapahtumakalenterille,  gallupille ja uutisille on omat yll&auml;pitok&auml;ytt&ouml;liittym&auml;ns&auml;, josta merkint&ouml;j&auml; voi  lis&auml;t&auml; tai poistaa.</li>
  <li>Dynaamisuus: Sis&auml;lt&ouml; kootaan  dynaamisesti useasta moduulista. Sis&auml;lt&ouml; on ajankohtaista.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Kuvapalkin valokuvat</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Valokuvia, jotka el&auml;v&ouml;itt&auml;v&auml;t  sivuja (vaihtelee sivuittain) (otamme uusia kuvia)</li>
  <li>Kohderyhm&auml;t: Kuuluu kiinte&auml;sti ulkoasuun</li>
  <li>Tavoitteet: El&auml;v&ouml;itt&auml;&auml; ulkoasua. Luoda  positiivisia mielikuvia.</li>
  <li>L&auml;hdemateriaali: Valokuva-arkisto ja  uudet itseotetut kuvat.</li>
  <li>Muokkaus: Uusia kuvia voi sy&ouml;tt&auml;&auml;  admin-k&auml;ytt&ouml;liittym&auml;n kautta.</li>
  <li>Dynaamisuus: Arvotaan sivulatauksella  tai sivuittain.</li>
  <li>Moduuli: Satunnaiskuva</li>
</ul>
<p><strong>Tapahtumakalenteri</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Etusivua tarkempi kuvaus  tapahtumista (dynaamista ja ajankohtaista)</li>
  <li>Kohderyhm&auml;t: aktiivikillistit (t&auml;rke&auml;)</li>
  <li>Tavoitteet: Tajota tapahtumien tarkat  tiedot.</li>
  <li>L&auml;hdemateriaali: Killan tiedottaja.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Dynaaminen. Vanha sis&auml;lt&ouml;  poistuu automaattisesti.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tapahtumakalenteri.</li>
</ul>
<p><strong>Tietoa killasta</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Yleiskuvaus killasta  (kirjoitetaan uusiksi)</li>
  <li>Kohderyhm&auml;t: Kiltaan kuulumattomat  k&auml;vij&auml;t (kriittinen)</li>
  <li>Tavoitteet: Sis&auml;lt&auml;&auml; peruskuvauksen  killasta ja sen toimminnasta.</li>
  <li>L&auml;hdemateriaali: Hallituksen vahvistamaa  tietoa. Valtuutettu k&auml;ytt&auml;j&auml;, esimerkiksi killan sihteeri, p&auml;ivitt&auml;&auml;  tarvittaessa sis&auml;lt&ouml;&auml;.</li>
  <li>Muokkaus: Moduulin yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Hallitus</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Tietoa hallituksesta ja sen  j&auml;senist&auml; (muotoillaan uusiksi)</li>
  <li>Kohderyhm&auml;t: Kiltaan yhteydess&auml; olevat  ulkopuoliset (kriittinen), kiltalaiset (t&auml;rke&auml;)</li>
  <li>Tavoitteet: Sis&auml;lt&auml;&auml; hallituksen j&auml;senet  ja yhteystiedot.</li>
  <li>L&auml;hdemateriaali: Hallitus, sihteeri.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Toimihenkil&ouml;t</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Tietoa killan toimihenkil&ouml;ist&auml;  (muotoillaan uusiksi)</li>
  <li>Kohderyhm&auml;t: Kiltalaiset (t&auml;rke&auml;),  muiden kiltojen toimihenkil&ouml;t</li>
  <li>Tavoitteet: Sis&auml;lt&auml;&auml; listan killan  toimihenkil&ouml;ist&ouml;, sek&auml; heid&auml;n yhteystietonsa.</li>
  <li>L&auml;hdemateriaali: Hallitus, sihteeri.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Arkisto</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Kokousten p&ouml;yt&auml;kirjat,  yhteystiedot, tilinumerot, laskupohjat, virallisuudet, s&auml;&auml;nn&ouml;t, muuta  sekalaista materiaalia, joka liittyy kiltaan. (k&auml;ytet&auml;&auml;n vanhaa sis&auml;lt&ouml;&auml;)</li>
  <li>Kohderyhm&auml;t: Aktiivikiltalaiset  (kriittinen), muut kiltalaiset</li>
  <li>Tavoitteet: Tarjota arkistoitua  sekalaista tietoa t&auml;rkeist&auml; killan asioista.</li>
  <li>L&auml;hdemateriaali: Kyseisest&auml;  l&auml;hdemateriaalista tai l&auml;hdemateriaali ryhm&auml;st&auml; vastuussa olevat.</li>
  <li>Muokkaus:  Arkistonhallinointij&auml;rjestelm&auml;.</li>
  <li>Dynaamisuus: Pelk&auml;st&auml;&auml;n dynaamista  tietoa tallessa olevista tiedostoista.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Arkisto</li>
</ul>
<p><strong>Phuksit</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Tietoa phukseille (kirjoitetaan  uusiksi)</li>
  <li>Kohderyhm&auml;t: Juuri aloittaneet tai  aloittamassa olevat opiskelijat (kriittinen)</li>
  <li>Tavoitteet: Tarjota opiskelua tukevaa  sek&auml; kiltatoimintaan liittyv&auml;&auml; tietoa phukseille.</li>
  <li>L&auml;hdemateriaali: Hallitus, isohenkil&ouml;t  ja muut valtuutetut henkil&ouml;t.</li>
  <li>Muokkaus: Moduulin yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Abit (ja alasivut)</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Tietoa abeille opiskelusta  laitoksella ja TKK:lla (kirjoitetaan uusiksi)</li>
  <li>Kohderyhm&auml;t: Abit (kriittinen)</li>
  <li>Tavoitteet: Tarjota tietoa opiskelupaikan  valinnan tueksi.</li>
  <li>L&auml;hdemateriaali: Nykyinen materiaali,  abi-infot.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Opiskelun tuki, Phuksiopas, Isot, Pisteet (Phuksit-sivun alasivuja)</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Informaatiota phukseille  kullakin Phuksit -alasivulla nimen esitt&auml;m&auml;st&auml; aiheesta. (k&auml;ytet&auml;&auml;n vanhaa  sis&auml;lt&ouml;&auml;)</li>
  <li>Kohderyhm&auml;t: Phuksit (t&auml;rke&auml;)</li>
  <li>Tavoitteet: Tarjota kattava tietoa  kaikesta tarpeellisesta mit&auml; phuksin olisi hyv&auml; tiet&auml;&auml;.</li>
  <li>L&auml;hdemateriaali: Hallitus, isohenkil&ouml;t  ja muut valtuutetut henkil&ouml;t.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/(en)</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Opiskelu, alasivut</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Opiskeluun liittyvi&auml; linkkej&auml;  ja yhteystietoja. (k&auml;ytet&auml;&auml;n vanhaa sis&auml;lt&ouml;&auml;)</li>
  <li>Kohderyhm&auml;t: Killan j&auml;senet (t&auml;rke&auml;)</li>
  <li>Tavoitteet: Tarjota opintomestarin ja  -neuvojan yhteystiedot, sek&auml; linkkej&auml; esimerkiksi labrojen sivuille.</li>
  <li>L&auml;hdemateriaali: Hallitus,  opintomestari, opintoneuvoja.</li>
  <li>Muokkaus: Moduulin  yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Ei dynaamista sis&auml;lt&ouml;&auml;.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Tavallinen sivu.</li>
</ul>
<p><strong>Webcam</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Webcamin kuvaa kiltahuoneelta  (dynaaminen)</li>
  <li>Kohderyhm&auml;t: Kiltalaiset (kriittinen),  muut (mielenkiintoinen)</li>
  <li>Tavoitteet: N&auml;ytt&auml;&auml; reaaliajassa kuvaa  kiltahuoneelta.</li>
  <li>L&auml;hdemateriaali: L&auml;hes reaaliaikaisesti  kiltahuoneelta.</li>
  <li>Muokkaus: Tarvittaessa atk-toimihenkil&ouml;t</li>
  <li>Dynaamisuus: Reaaliaikainen</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: Webcam</li>
</ul>
<p><strong>Tapahtumailmoittautumiset</strong></p>
<ul>
  <li>Sis&auml;lt&ouml;: Tapahtumien ilmoittautumislomakkeet  (dynaaminen ja ajankohtainen)</li>
  <li>Kohderyhm&auml;t: Kiltalaiset (kriittinen)</li>
  <li>Tavoitteet: Tarjota helppo ty&ouml;kalu  ilmoittautumislistojen luomiseen sek&auml; itse ilmoittautumiseen.</li>
  <li>L&auml;hdemateriaali: Tapahtuman j&auml;rjest&auml;j&auml;.</li>
  <li>Muokkaus: Moduulin yll&auml;pitok&auml;ytt&ouml;liittym&auml;.</li>
  <li>Dynaamisuus: Dynaamista  tapahtumakohtaista sis&auml;lt&ouml;&auml;. Vanhat ilmoittautumiset sulkeutuvat ja katoavat  n&auml;kyvist&auml; itsest&auml;&auml;n.</li>
  <li>Julkaisukielet: fi/en</li>
  <li>Moduuli: ilmottautumisj&auml;rjestelm&auml;</li>
</ul>

<h2>Ajankäyttö ja aikataulu</h2>
<p>Ajankäyttösuunnitelma on esitetty alla olevassa taulukossa. Tarkoituksena on aloittaa korkean tason arkkitehtuurista ja kriittisistä toiminnoista, ja edetä hiljalleen perustoimintoihin ja viimeistelyyn.</p>
<table class="ajankaytto">
<thead>
	<tr>
		<td colspan="2"></td>
		<th colspan="3">suunnitelma (h)</th>
		<th colspan="3">toteuma (h)</th>
	</tr>
	<tr>
		<td colspan="2" style="text-align:right;">Valmiina viikolla</td>
		<td>T</td>
		<td>J</td>
		<td>A</td>
		<td>T</td>
		<td>J</td>
		<td>A</td>
	</tr>
</thead>
<tbody>
<tr><th>Projektin pystytys (serveri, svn...)</th>		<td>6</td> <td>6</td> <td>4</td> <td>4</td> <td>5</td> <td>2</td><td>4</td></tr>
<tr><th>Arkkitehtuurin suunnittelu</th>				<td>7</td> <td>5</td> <td>5</td> <td>3</td> <td>3</td> <td>3</td><td>2</td></tr>
<tr><th>Yleinen suunnittelu</th>				<td>8</td> <td>3</td> <td>3</td> <td>3</td> <td>4</td> <td>2</td><td>3</td></tr>
<tr><th>Korkean tason arkkitehtuurin protoilu</th>		<td>9</td> <td>16</td><td>4</td> <td>0</td> <td>11</td><td>0</td><td>0</td></tr>
<tr><th>Navigoinnin toteuttaminen</th>				<td>10</td><td>8</td> <td>0</td> <td>0</td> <td>3</td> <td>0</td><td>0</td></tr>
<tr><th>Suunnitelmadokumentin kirjoittaminen</th>		<td>11</td><td>6</td> <td>6</td> <td>6</td> <td>10</td><td>3</td><td>6</td></tr>
<tr><th>Alustava graafinen suunnittelu</th>			<td>12</td><td>0</td> <td>0</td> <td>10</td><td>0</td> <td>0</td><td>10</td></tr>
<tr><th>Moduulien toiminta</th>					<td>12</td><td>6</td> <td>6</td> <td>0</td> <td>_</td> <td>2</td><td>_</td></tr>
<tr><th>Autentikointi ja alustavia admin-toimintoja</th>	<td>13</td><td>8</td> <td>8</td> <td>0</td> <td>_</td> <td>0</td><td>_</td></tr>
<tr><th>Staattiset sivut toimimaan</th>				<td>13</td><td>2</td> <td>2</td> <td>5</td> <td>_</td> <td>0</td><td>_</td></tr>
<tr><th>Cache</th>						<td>14</td><td>0</td> <td>6</td> <td>0</td> <td>_</td> <td>0</td><td>_</td></tr>
<tr><th>Ilmoittautuminen</th>					<td>15</td><td>0</td> <td>12</td><td>0</td> <td>_</td> <td>0</td><td>_</td></tr>
<tr><th>Demon valmistelu</th>					<td>16</td><td>6</td> <td>0</td> <td>0</td> <td>_</td> <td>2</td><td>_</td></tr>
<tr><th>Gallup</th>						<td>17</td><td>2</td> <td>2</td> <td>2</td> <td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Uutiset</th>						<td>17</td><td>0</td> <td>0</td> <td>10</td><td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Demon valmistelu</th>					<td>18</td><td>0</td> <td>4</td> <td>0</td> <td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Edistyneet admin-toiminnot</th>				<td>19</td><td>16</td><td>16</td><td>0</td> <td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Ulkoasun ja käyttöliittymän hiominen</th>		<td>20</td><td>2</td> <td>2</td> <td>10</td><td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Sisällön kirjoittaminen</th>				<td>20</td><td>4</td> <td>4</td> <td>4</td> <td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
<tr><th>Toteutusdokumentin kirjoittaminen</th>			<td>21</td><td>6</td> <td>6</td> <td>6</td> <td>&nbsp;</td> <td>&nbsp;</td><td>&nbsp;</td></tr>
</tbody>
<tfoot><td colspan="8">&nbsp;</td></tfood>
</table>

<h1>Demo</h1>
<p><strong>Ulkoasu ja käyttöliittymä</strong></p>
<p>Ulkoasu oli jo pitk&auml;lle kehitelty suunnitteluvaiheen dokumentissa ja muutoksia lopulliseen versioon tulee v&auml;h&auml;n. Leiskan alustava leikkely onnistui helposti ja sivun ulkoasun elementtien yhteiskoko saadaan n. 130-160 kilotavuun. Ulkoasusta tuli dynaaminen ja tyylitiedostosta saatiin melko yksinkertainen.</p>
<p>Sivuston k&auml;ytt&ouml;liittym&auml; vaikuttaa t&auml;ss&auml; vaiheessa toimivalta, ja tulemme laittamaan lopulliseen dokumenttiin yksityiskohtaisempia k&auml;ytt&ouml;kokemuksia.</p>


    Esimerkkisivut
    Liittäkää dokumenttiin kuvia sivuston sivuista eri selainohjelmilla katsottuna. Tarkoituksena on nähdä, miltä sivusto eri käyttäjille näyttää. Esimerkkisivujen kuvia saa palautuksessa olla enintään 8 kappaletta. Mukana tulisi olla

        * Sivuston pääsivu
        * Esimerkkejä eri sivutyypeistä (alisivukokonaisuudet tms.)
        * Aktiiviseen elementtiin liittyvä tai elementin sisältävä sivu
        * Yksi sivu, jossa on käytetty tyylimäärittelyjä (CSS) 

    Valitkaa esimerkkiselaimiksi

        * Uudehko yleisesti käytössä oleva graafinen selain, kuten Internet Explorer.
        * Vanha graafinen selain, esimerkiksi Netscape 4.x
        * Muu yleisesti käytössä oleva selain, kuten Opera, Mozilla Firefox, Konqueror
        * Tekstipohjainen selain, kuten Lynx 

    Myös muita selainohjelmia saa käyttää yllämainittujen lisäksi. (matkapuhelimet, Macin selaimet jne.)
    Käyttöliittymä ja graafinen ulkoasu

    Esittäkää toteutetut navigointiratkaisut ja muu käyttöliittymä. Esittäkää myös (esimerkiksi yllä olevien esimerkkikuvien perusteella) toteutunut graafinen ulkoasu. 

Aktiivinen elementti ja sivuston tekniikka (6 pistettä)

    Aktiivinen elementti
    Selostakaa aktiivisen elementin toteutus ja toiminta. Elementin lähdekoodi tulee sijoittaa hype-palvelimelle ja sijainti, joko URL tai hakemisto, tulee ilmoittaa dokumentissa. Lähdekoodin tulee olla kommentoitua ja assistenttien luettavissa. Arvioikaa myös valitsemanne toteutustavan sopivuutta tähän tarkoitukseen.
    Sivuston asennus ja tietoturva

    Kertokaa, mitä sivuston asennus uudelle palvelimelle vaatii ja kuinka se tehdään. Kertokaa myös, minkälaisia tietoturvakysymyksiä sivustossa ja erityisesti aktiivisessa elementissä on ilmennyt ja miten niihin on vastattu. 

WWW-tekniikka (4 pistettä)

    HTML

    Sivuston HTML-koodin (myös mahdollisen aktiivisen elementin tuottaman koodin) tulee olla kunnollista. Peruskoodin tulee olla joko HTML- tai XHTML-spesifikaation mukaista. Käytä soveltuvinta spesifikaatioiden versiota. Sivujen tulee pääsääntöisesti validoitua ilman virheitä. Jos virhettä ei jossain tilanteessa voi välttää, täytyy se voida perustella. Arvostelussa huomioidaan myös sivujen toimivuus eri selainohjelmilla.

    Liittäkää dokumenttiin pätkä HTML-listausta jostain näytetystä esimerkkisivusta. (Älkää kuitenkaan käyttääkö kahta dokumentin sivua enempää HTML-koodille!) Sisällyttäkää dokumenttiin lisäksi esimerkivalidointitulos W3C:n validaattoriohjelmalta tai -palvelulta.
    CSS-sivujen listaukset

    Antakaa esimerkki sivustossa käytetyn tyylisivun lähdekoodista. Kertokaa myös perustelut sille, missä olette tyylisivuja käyttäneet, ja mitä niillä on haluttu tehdä.
    Selainrajoitukset

    Esittäkää selvitys ja perustelut siitä, onko joku osa sivustosta selainriippuvaa. Kertokaa myös miten asia on ilmoitettu käytäjille ja miten muiden selainohjelmien käyttäjät on huomioitu (esimerkiksi vaihtoehtoisilla sivulla tms.) 

Projektin aikataulu (4 pistettä)

    Ajankäyttö ja aikataulu

    Esittäkää koko harjoitustyössä toteutunut ajankäyttö. Arvioikaa lyhyesti myös mahdollisia poikkeamia alkuperäisestä suunnitelmasta. 

Muuta arvosteltavaa

    Painotus (4 pistettä)

    Harjoitustyön painoitusvaihtoehtoja on kolme: sisällöntuotanto, sivuston ulkoasu+käyttöliittymä ja aktiivinen elementti. Ryhmän valitsema painotus nostaa toteutusvaiheessa vastaavan dokumentin kohdan arvostelun maksimipistemäärää 4:llä pisteellä.
    Yleisvaikutelma (6 pistettä)

    Yleisvaikutelmapisteillä arvioidaan kaikki sellainen työssä oleva, joka ei mahdu muihin kategorioihin. Esimerkiksi jos joku osa työstä on toteutettu erittäin ansioituneesti, jos toteutettava sivusto on erittäin toimiva, tai jos toteutusta on viety normaalia pidemmälle (testaus, käytettävyystestit jne.), nostaa tämä yleisvaikutelmaa. 
    

</body>
</html>
